%***********************************************************************
% function vout = DF_DU_New(x,u,v,W1,W2)
%       x:模型输入状态变量；
%       u:模型输入控制量；
%       v:模型输入扰动变量
%       W1：模型隐层到输入层权值矩阵（含阈值）；
%       W2：模型输出层到隐层层权值矩阵（含阈值）；
%       修订日期：2017-07-14
%       作者：Yibing Ran
% ------------------修订---------------------------------------
%-       修订日期：2017-08-17
%        作者：冉义兵
%        功能：激活函数purelin该为logsig


function y = DF_DX_New( x,u,v,W1,W2)
    A=cat(1,x,u,v,1);        %输入，(NIn_Model,1)
    S1=W1*A;
    B=tansig(S1);                 %第一层(隐藏)神经元的输出
    [q,p]=size(W2);               %p:隐层节点数  
    nx=length(x);
    B(p)=1;                      %隐层阈值(工具箱训练模型)
    S2=W2*B;                      %输出-隐层线性求和
    dB_dS1=4*exp(-2*S1)./(1+exp(-2*S1)).^2;
    df_dS2=exp(-S2)./(1+exp(-S2)).^2;
    W1=W1(:,1:nx);     
    W2=W2(:,1:p-1);
    y=((diag(df_dS2)*W2))*(diag(dB_dS1)*W1);

    

    
    